/*
给定方法 rand7 可生成 [1,7] 范围内的均匀随机整数，试写一个方法 rand10 生成 [1,10]
    范围内的均匀随机整数。

你只能调用 rand7() 且不能调用其他方法。请不要使用系统的 Math.random() 方法。

每个测试用例将有一个内部参数 n，即你实现的函数 rand10() 在测试时将被调用的次数。
    请注意，这不是传递给 rand10() 的参数。
*/
#include<iostream>
#include<cmath>

#define rand7 = (rand()+1)%8

/*
    拒绝采样
    1  2  3   4   5   6   7
1   1  2  3   4   5   6   7
2   2  4  6   8   10  12  14
3   3  6  9   12  15  18  21
4   4  8  12  16  20  24  28
5   5  10 15  20  25  30  35
6   6  12 18  24  30  36  42
7   7  14 21  28  35  42  49

    1  2  3   4   5   6   7
1   1  2  3   4   5   6   7
2   8  9  10  1   2   3   4
3   5  6  7   8   9   10  1
4   2  3  4   5   6   7   8
5   9  10 1   2   3   4   5
6   6  7  8   9   10  *   *
7   *  *  *   *   *   *   *
*/

int rand10() {
    int col=0, row=0, idx=1;
    do{
        col = rand7;
        row = rand7;
        idx = (row-1)*7 + col;
    }while(idx>40);
    return 1 + (idx-1)%10;
}
